#pragma once

#include "ImageData.h"

////////////////////////////////////////////////////////////////////////////////
//
/// Интерфейс для фильтров обработки изображения.
/**
  Интерфейс IImageFilter определяет базовые методы для работы с фильтрами изображений.
 */
////////////////////////////////////////////////////////////////////////////////
class IImageFilter {
public:
    /// Виртуальный деструктор
    virtual ~IImageFilter() = default;
    /// Применение фильтра к изображению
    virtual void Apply(ImageData* image) const = 0;
};
